SENKU114514/PY32F030BasicFrame/EXTERN/HW_INIT/LOWPOWER/LowPower.c
#include "./HW_INIT/LOWPOWER/LowPower.h"

#include "./SYS/system_init.h"
#if defined(PY32F002BPRE)
#include "py32f002b_ll_adc.h"
#include "py32f002b_ll_bus.h"
#include "py32f002b_ll_cortex.h"
#include "py32f002b_ll_i2c.h"
#include "py32f002b_ll_pwr.h"
#include "py32f002b_ll_spi.h"
#include "py32f002b_ll_tim.h"
#include "py32f002b_ll_usart.h"
#include "py32f002b_ll_exti.h"
#elif defined(PY32F030PRE)
#include "py32f0xx_ll_adc.h"
#include "py32f0xx_ll_bus.h"
#include "py32f0xx_ll_cortex.h"
#include "py32f0xx_ll_dma.h"
#include "py32f0xx_ll_i2c.h"
#include "py32f0xx_ll_pwr.h"
#include "py32f0xx_ll_spi.h"
#include "py32f0xx_ll_tim.h"
#include "py32f0xx_ll_usart.h"


#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
#include "LowPower_key.h"
#if defined(PY32F030PRE)
#include "py32f0xx_ll_exti.h"
#endif

/*
 * 长按唤醒使用示例：
 *
 * 1. 初始化一次，示例为 B2 上拉、按下接地，具体引脚由应用选择。
 *    status = HW_LowPower_init(B2, UP, LOW);
 *
 * 2. 初始化成功后，在主循环需要休眠的位置调用。
 *    status = HW_LowPower_Enter();
 *    // OK：已连续长按 3 秒，系统时钟和原外设已恢复。
 *    // BUSY / SUSPEND_FAILED：外设忙或无法暂停，本次未进入休眠。
 *
 * 3. LED、电源使能等板级负载在 PrepareCallback 中关闭，在 RestoreCallback 中恢复。
 *    // 芯片 GPIO 保持原输出；模块无法推断板外设备的关闭电平。
 *
 * 工作过程：Stop1 等按键 → 1MHz 确认长按 → 短按继续 Stop / 满 3 秒恢复业务。
 * 按键确认期间普通外设保持暂停，使用 SysTick 轮询，不开放业务中断。
 */

/* Stop档位配置：Stop0唤醒快，Stop1功耗更低。 */
#if defined(PY32F002BPRE)
/* PWR_CR1.LPR: 00 = MR, 01 = LPR; F030 voltage selectors do not apply. */
#define LOWPOWER_002B_REGULATOR LL_PWR_LPR_MODE_LPR
#if ((LOWPOWER_002B_REGULATOR != LL_PWR_LPR_MODE_MR) && \
     (LOWPOWER_002B_REGULATOR != LL_PWR_LPR_MODE_LPR))
#error "LOWPOWER_002B_REGULATOR is invalid"
#endif
#elif defined(PY32F030PRE)
#define LOWPOWER_STOP_MODE_STOP0           0U
#define LOWPOWER_STOP_MODE_STOP1_1V2       1U
#define LOWPOWER_STOP_MODE_STOP1_1V0       2U
#define LOWPOWER_STOP_MODE                 LOWPOWER_STOP_MODE_STOP1_1V0		//此处设置具体功耗
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif

/* 外设管理开关：1表示暂停、清旧事件并按原状态恢复，0表示低功耗模块不处理。 */
#define LOWPOWER_MANAGE_TIM1               1U
#define LOWPOWER_MANAGE_TIM3               1U
#define LOWPOWER_MANAGE_TIM14              1U
#define LOWPOWER_MANAGE_TIM16              1U
#define LOWPOWER_MANAGE_TIM17              1U
#define LOWPOWER_MANAGE_ADC1               1U
#define LOWPOWER_MANAGE_SPI1               1U
#define LOWPOWER_MANAGE_I2C1               1U
#define LOWPOWER_MANAGE_USART1             1U
#define LOWPOWER_MANAGE_USART2             1U
#define LOWPOWER_MANAGE_DMA1               1U

/* 固定管理当前框架支持的普通外设，调用者无需逐项选择。 */

#if defined(PY32F030PRE)
#if ((LOWPOWER_STOP_MODE != LOWPOWER_STOP_MODE_STOP0) && \
     (LOWPOWER_STOP_MODE != LOWPOWER_STOP_MODE_STOP1_1V2) && \
     (LOWPOWER_STOP_MODE != LOWPOWER_STOP_MODE_STOP1_1V0))
#error "LOWPOWER_STOP_MODE is invalid"
#endif
#endif

#define LOWPOWER_IRQ_UNUSED                 (-1)

typedef enum
{
    LOWPOWER_TIMER_BUS_APB1_GROUP1,
    LOWPOWER_TIMER_BUS_APB1_GROUP2,
} LowPower_TimerBus_e;

typedef struct
{
    IRQn_Type irqn;
    uint32_t was_enabled;
} LowPower_IrqState_t;

typedef struct
{
    uint32_t clock_was_enabled;
    uint32_t cr1;
    uint32_t dier;
    uint32_t ccer;
    uint32_t bdtr;
    LowPower_IrqState_t irq1;
    LowPower_IrqState_t irq2;
} LowPower_TimerState_t;

typedef struct
{
    uint32_t ahb1_clock_mask;
    uint32_t apb1_group1_clock_mask;
    uint32_t apb1_group2_clock_mask;
    uint32_t spi1_cr1;
    uint32_t spi1_cr2;
    uint32_t i2c1_cr1;
    uint32_t i2c1_cr2;
    uint32_t usart1_cr1;
    uint32_t usart1_cr3;
    uint32_t usart2_cr1;
    uint32_t usart2_cr3;
    uint32_t adc1_was_prepared;
    uint32_t adc1_was_enabled;
    uint32_t adc1_ier;
    uint32_t dma1_channel1_ccr;
    uint32_t dma1_channel2_ccr;
    uint32_t dma1_channel3_ccr;
    LowPower_IrqState_t spi1_irq;
    LowPower_IrqState_t i2c1_irq;
    LowPower_IrqState_t usart1_irq;
    LowPower_IrqState_t usart2_irq;
    LowPower_IrqState_t dma1_channel1_irq;
    LowPower_IrqState_t dma1_channel2_3_irq;
} LowPower_PeripheralState_t;

static LowPower_PeripheralState_t s_peripheral_state;

#if LOWPOWER_MANAGE_TIM1 && defined(TIM1)
static LowPower_TimerState_t s_tim1_state;
#endif
#if LOWPOWER_MANAGE_TIM3 && defined(TIM3)
static LowPower_TimerState_t s_tim3_state;
#endif
#if LOWPOWER_MANAGE_TIM14 && defined(TIM14)
static LowPower_TimerState_t s_tim14_state;
#endif
#if LOWPOWER_MANAGE_TIM16 && defined(TIM16)
static LowPower_TimerState_t s_tim16_state;
#endif
#if LOWPOWER_MANAGE_TIM17 && defined(TIM17)
static LowPower_TimerState_t s_tim17_state;
#endif

/* 读取指定NVIC中断在休眠前是否处于使能状态。 */
static uint32_t lowpower_irq_is_enabled(IRQn_Type irqn)
{
    return ((NVIC->ISER[0] & (1UL << ((uint32_t)irqn & 0x1FU))) != 0U) ? 1U : 0U;
}

/* 保存并关闭一个NVIC中断，同时丢弃休眠前尚未处理的旧Pending。 */
static void lowpower_suspend_irq(LowPower_IrqState_t *p_state, IRQn_Type irqn)
{
    p_state->irqn = irqn;
    p_state->was_enabled = lowpower_irq_is_enabled(irqn);
    NVIC_DisableIRQ(irqn);
    NVIC_ClearPendingIRQ(irqn);
}

/* 按休眠前状态恢复一个NVIC中断。 */
static void lowpower_resume_irq(const LowPower_IrqState_t *p_state)
{
    NVIC_ClearPendingIRQ(p_state->irqn);
    if (p_state->was_enabled != 0U)
    {
        NVIC_EnableIRQ(p_state->irqn);
    }
}

/* 查询指定定时器的APB时钟是否开启。 */
static uint32_t lowpower_timer_clock_is_enabled(LowPower_TimerBus_e bus, uint32_t clock_mask)
{
    if (bus == LOWPOWER_TIMER_BUS_APB1_GROUP1)
    {
        return LL_APB1_GRP1_IsEnabledClock(clock_mask);
    }

    return LL_APB1_GRP2_IsEnabledClock(clock_mask);
}

/* 关闭指定定时器的APB时钟。 */
static void lowpower_timer_clock_disable(LowPower_TimerBus_e bus, uint32_t clock_mask)
{
    if (bus == LOWPOWER_TIMER_BUS_APB1_GROUP1)
    {
        LL_APB1_GRP1_DisableClock(clock_mask);
    }
    else
    {
        LL_APB1_GRP2_DisableClock(clock_mask);
    }
}

/* 开启指定定时器的APB时钟。 */
static void lowpower_timer_clock_enable(LowPower_TimerBus_e bus, uint32_t clock_mask)
{
    if (bus == LOWPOWER_TIMER_BUS_APB1_GROUP1)
    {
        LL_APB1_GRP1_EnableClock(clock_mask);
    }
    else
    {
        LL_APB1_GRP2_EnableClock(clock_mask);
    }
}

/* 保存一个定时器的运行状态并停止其计数、请求和时钟。 */
static void lowpower_suspend_timer(TIM_TypeDef *p_timer,
                                   LowPower_TimerBus_e bus,
                                   uint32_t clock_mask,
                                   IRQn_Type irq1,
                                   int32_t irq2,
                                   uint32_t has_main_output,
                                   LowPower_TimerState_t *p_state)
{
    p_state->clock_was_enabled = lowpower_timer_clock_is_enabled(bus, clock_mask);
    lowpower_suspend_irq(&p_state->irq1, irq1);

    if (irq2 >= 0)
    {
        lowpower_suspend_irq(&p_state->irq2, (IRQn_Type)irq2);
    }

    if (p_state->clock_was_enabled == 0U)
    {
        return;
    }

    p_state->cr1 = LL_TIM_ReadReg(p_timer, CR1);
    p_state->dier = LL_TIM_ReadReg(p_timer, DIER);
    p_state->ccer = LL_TIM_ReadReg(p_timer, CCER);
    if (has_main_output != 0U)
    {
        p_state->bdtr = LL_TIM_ReadReg(p_timer, BDTR);
    }

    LL_TIM_WriteReg(p_timer, DIER, 0U);
    LL_TIM_DisableCounter(p_timer);
    LL_TIM_WriteReg(p_timer, CCER, 0U);
    if (has_main_output != 0U)
    {
        CLEAR_BIT(p_timer->BDTR, TIM_BDTR_MOE);
    }
    LL_TIM_WriteReg(p_timer, SR, 0U);
    lowpower_timer_clock_disable(bus, clock_mask);
}

/* 按休眠前状态恢复一个定时器的时钟、请求、中断和计数。 */
static void lowpower_resume_timer(TIM_TypeDef *p_timer,
                                  LowPower_TimerBus_e bus,
                                  uint32_t clock_mask,
                                  int32_t irq2,
                                  uint32_t has_main_output,
                                  const LowPower_TimerState_t *p_state)
{
    if (p_state->clock_was_enabled != 0U)
    {
        lowpower_timer_clock_enable(bus, clock_mask);
        LL_TIM_WriteReg(p_timer, DIER, 0U);
        LL_TIM_DisableCounter(p_timer);
        LL_TIM_WriteReg(p_timer, SR, 0U);
        LL_TIM_WriteReg(p_timer, CCER, p_state->ccer);
        if (has_main_output != 0U)
        {
            LL_TIM_WriteReg(p_timer, BDTR, p_state->bdtr);
        }
        LL_TIM_WriteReg(p_timer, DIER, p_state->dier);
    }

    lowpower_resume_irq(&p_state->irq1);

    if (irq2 >= 0)
    {
        lowpower_resume_irq(&p_state->irq2);
    }

    if (p_state->clock_was_enabled != 0U)
    {
        LL_TIM_WriteReg(p_timer, CR1, p_state->cr1);
    }
}

