SENKU114514/PY32F030BasicFrame/EXTERN/HW_INIT/LOWPOWER/LowPower.c
/* 按休眠前状态重新开启ADC并恢复其中断配置。 */
static void lowpower_restore_adc(void)
{
#if LOWPOWER_MANAGE_ADC1 && defined(ADC1)
    uint32_t delay_cycles;

    if (s_peripheral_state.adc1_was_prepared == 0U)
    {
        return;
    }

    if (LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_ADC1) == 0U)
    {
        LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_ADC1);
    }
    if ((s_peripheral_state.adc1_was_enabled != 0U) &&
        (LL_ADC_IsEnabled(ADC1) == 0U))
    {
        LL_ADC_Enable(ADC1);
        for (delay_cycles = 0U;
             delay_cycles < LL_ADC_DELAY_CALIB_ENABLE_CPU_CYCLES;
             delay_cycles++)
        {
            __NOP();
        }
    }

    ADC1->IER = s_peripheral_state.adc1_ier;
    s_peripheral_state.adc1_was_prepared = 0U;
#endif
}

/* 在关闭全局中断前安全停止ADC，避开LL_ADC_Disable内部的中断切换。 */
static uint32_t lowpower_prepare_adc(void)
{
#if LOWPOWER_MANAGE_ADC1 && defined(ADC1)
    s_peripheral_state.adc1_was_prepared = 0U;
    if (LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_ADC1) == 0U)
    {
        return 1U;
    }
    if (LL_ADC_REG_IsConversionOngoing(ADC1) != 0U)
    {
        return 0U;
    }

    s_peripheral_state.adc1_was_enabled = LL_ADC_IsEnabled(ADC1);
    s_peripheral_state.adc1_ier = ADC1->IER;
    s_peripheral_state.adc1_was_prepared = 1U;
    ADC1->IER = 0U;

#if defined(PY32F002BPRE)
    if (s_peripheral_state.adc1_was_enabled != 0U)
    {
        uint32_t wait = 10000U;
        LL_ADC_Disable(ADC1); /* ADDIS request; wait until ADEN clears. */
        while (LL_ADC_IsEnabled(ADC1) && wait != 0U) wait--;
        if (LL_ADC_IsEnabled(ADC1))
        {
            lowpower_restore_adc();
            return 0U;
        }
    }
#elif defined(PY32F030PRE)
    if ((s_peripheral_state.adc1_was_enabled != 0U) &&
        (LL_ADC_Disable(ADC1) != SUCCESS))
    {
        lowpower_restore_adc();
        return 0U;
    }
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
#endif

    return 1U;
}

/* 检查通信、转换和DMA是否已经完成，忙时禁止直接进入Stop。 */
static uint32_t lowpower_peripheral_is_busy(void)
{
#if LOWPOWER_MANAGE_ADC1 && defined(ADC1)
    if ((LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_ADC1) != 0U) &&
        ((LL_ADC_REG_IsConversionOngoing(ADC1) != 0U) ||
         ((s_peripheral_state.adc1_was_prepared != 0U) && (LL_ADC_IsEnabled(ADC1) != 0U))))
    {
        return 1U;
    }
#endif

#if LOWPOWER_MANAGE_SPI1 && defined(SPI1)
    if ((LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_SPI1) != 0U) &&
        ((LL_SPI_IsActiveFlag_BSY(SPI1) != 0U) ||
         (LL_SPI_GetTxFIFOLevel(SPI1) != LL_SPI_TX_FIFO_EMPTY) ||
         (LL_SPI_GetRxFIFOLevel(SPI1) != LL_SPI_RX_FIFO_EMPTY)))
    {
        return 1U;
    }
#if defined(DMA1)
    if ((LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_SPI1) != 0U) &&
        ((READ_BIT(SPI1->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN)) != 0U) &&
        (LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1) != 0U) &&
        ((LL_DMA_IsEnabledChannel(DMA1, LL_DMA_CHANNEL_1) != 0U) ||
         (LL_DMA_IsEnabledChannel(DMA1, LL_DMA_CHANNEL_2) != 0U)))
    {
        return 1U;
    }
#endif
#endif

#if LOWPOWER_MANAGE_I2C1 && defined(I2C1)
    if ((LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1) != 0U) &&
        (LL_I2C_IsEnabled(I2C1) != 0U) &&
        (LL_I2C_IsActiveFlag_BUSY(I2C1) != 0U))
    {
        return 1U;
    }
#endif

#if LOWPOWER_MANAGE_USART1 && defined(USART1)
    if ((LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_USART1) != 0U) &&
        (LL_USART_IsEnabled(USART1) != 0U) &&
        ((((READ_BIT(USART1->CR1, USART_CR1_TE)) != 0U) &&
          (LL_USART_IsActiveFlag_TC(USART1) == 0U)) ||
         (LL_USART_IsActiveFlag_RXNE(USART1) != 0U) ||
         (LL_USART_IsActiveFlag_ORE(USART1) != 0U) ||
         (LL_USART_IsActiveFlag_FE(USART1) != 0U) ||
         (LL_USART_IsActiveFlag_NE(USART1) != 0U)))
    {
        return 1U;
    }
#endif

#if LOWPOWER_MANAGE_USART2 && defined(USART2)
    if ((LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART2) != 0U) &&
        (LL_USART_IsEnabled(USART2) != 0U) &&
        ((((READ_BIT(USART2->CR1, USART_CR1_TE)) != 0U) &&
          (LL_USART_IsActiveFlag_TC(USART2) == 0U)) ||
         (LL_USART_IsActiveFlag_RXNE(USART2) != 0U) ||
         (LL_USART_IsActiveFlag_ORE(USART2) != 0U) ||
         (LL_USART_IsActiveFlag_FE(USART2) != 0U) ||
         (LL_USART_IsActiveFlag_NE(USART2) != 0U)))
    {
        return 1U;
    }
#endif

#if LOWPOWER_MANAGE_DMA1 && defined(DMA1)
    if ((LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1) != 0U) &&
        ((LL_DMA_IsEnabledChannel(DMA1, LL_DMA_CHANNEL_1) != 0U) ||
         (LL_DMA_IsEnabledChannel(DMA1, LL_DMA_CHANNEL_2) != 0U) ||
         (LL_DMA_IsEnabledChannel(DMA1, LL_DMA_CHANNEL_3) != 0U)))
    {
        return 1U;
    }
#endif

    return 0U;
}

/* 保存并暂停由配置开关选中的普通外设。 */
static void lowpower_suspend_peripherals(void)
{
    s_peripheral_state.ahb1_clock_mask = 0U;
    s_peripheral_state.apb1_group1_clock_mask = 0U;
    s_peripheral_state.apb1_group2_clock_mask = 0U;

#if LOWPOWER_MANAGE_DMA1 && defined(DMA1)
    lowpower_suspend_irq(&s_peripheral_state.dma1_channel1_irq, DMA1_Channel1_IRQn);
    lowpower_suspend_irq(&s_peripheral_state.dma1_channel2_3_irq, DMA1_Channel2_3_IRQn);
    if (LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1) != 0U)
    {
        s_peripheral_state.ahb1_clock_mask |= LL_AHB1_GRP1_PERIPH_DMA1;
        s_peripheral_state.dma1_channel1_ccr = DMA1_Channel1->CCR;
        s_peripheral_state.dma1_channel2_ccr = DMA1_Channel2->CCR;
        s_peripheral_state.dma1_channel3_ccr = DMA1_Channel3->CCR;
        CLEAR_BIT(DMA1_Channel1->CCR, DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_TEIE);
        CLEAR_BIT(DMA1_Channel2->CCR, DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_TEIE);
        CLEAR_BIT(DMA1_Channel3->CCR, DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_TEIE);
        LL_DMA_ClearFlag_GI1(DMA1);
        LL_DMA_ClearFlag_GI2(DMA1);
        LL_DMA_ClearFlag_GI3(DMA1);
    }
#endif

#if LOWPOWER_MANAGE_I2C1 && defined(I2C1)
    lowpower_suspend_irq(&s_peripheral_state.i2c1_irq, I2C1_IRQn);
    if (LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1) != 0U)
    {
        s_peripheral_state.apb1_group1_clock_mask |= LL_APB1_GRP1_PERIPH_I2C1;
        s_peripheral_state.i2c1_cr1 = I2C1->CR1;
        s_peripheral_state.i2c1_cr2 = I2C1->CR2;
#if defined(PY32F002BPRE)
        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
#elif defined(PY32F030PRE)
        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_DMAEN);
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
        LL_I2C_Disable(I2C1);
    }
#endif

