SENKU114514/PY32F030BasicFrame/EXTERN/HW_INIT/LOWPOWER/LowPower.c
#if LOWPOWER_MANAGE_USART2 && defined(USART2)
    lowpower_suspend_irq(&s_peripheral_state.usart2_irq, USART2_IRQn);
    if (LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART2) != 0U)
    {
        s_peripheral_state.apb1_group1_clock_mask |= LL_APB1_GRP1_PERIPH_USART2;
        s_peripheral_state.usart2_cr1 = USART2->CR1;
        s_peripheral_state.usart2_cr3 = USART2->CR3;
        CLEAR_BIT(USART2->CR3, USART_CR3_EIE | USART_CR3_CTSIE | USART_CR3_DMAR | USART_CR3_DMAT);
        CLEAR_BIT(USART2->CR1, USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE |
                                  USART_CR1_TXEIE | USART_CR1_PEIE);
        LL_USART_Disable(USART2);
    }
#endif

#if LOWPOWER_MANAGE_ADC1 && defined(ADC1)
    if (LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_ADC1) != 0U)
    {
        s_peripheral_state.apb1_group2_clock_mask |= LL_APB1_GRP2_PERIPH_ADC1;
    }
#endif

#if LOWPOWER_MANAGE_SPI1 && defined(SPI1)
    lowpower_suspend_irq(&s_peripheral_state.spi1_irq, SPI1_IRQn);
    if (LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_SPI1) != 0U)
    {
        s_peripheral_state.apb1_group2_clock_mask |= LL_APB1_GRP2_PERIPH_SPI1;
        s_peripheral_state.spi1_cr1 = SPI1->CR1;
        s_peripheral_state.spi1_cr2 = SPI1->CR2;
#if defined(PY32F002BPRE)
        CLEAR_BIT(SPI1->CR2, SPI_CR2_ERRIE | SPI_CR2_RXNEIE | SPI_CR2_TXEIE);
#elif defined(PY32F030PRE)
        CLEAR_BIT(SPI1->CR2, SPI_CR2_ERRIE | SPI_CR2_RXNEIE | SPI_CR2_TXEIE |
                                SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
        LL_SPI_Disable(SPI1);
    }
#endif

#if LOWPOWER_MANAGE_USART1 && defined(USART1)
    lowpower_suspend_irq(&s_peripheral_state.usart1_irq, USART1_IRQn);
    if (LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_USART1) != 0U)
    {
        s_peripheral_state.apb1_group2_clock_mask |= LL_APB1_GRP2_PERIPH_USART1;
        s_peripheral_state.usart1_cr1 = USART1->CR1;
        s_peripheral_state.usart1_cr3 = USART1->CR3;
#if defined(PY32F002BPRE)
        CLEAR_BIT(USART1->CR3, USART_CR3_EIE | USART_CR3_CTSIE);
#elif defined(PY32F030PRE)
        CLEAR_BIT(USART1->CR3, USART_CR3_EIE | USART_CR3_CTSIE | USART_CR3_DMAR | USART_CR3_DMAT);
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
        CLEAR_BIT(USART1->CR1, USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE |
                                  USART_CR1_TXEIE | USART_CR1_PEIE);
        LL_USART_Disable(USART1);
    }
#endif

    if (s_peripheral_state.ahb1_clock_mask != 0U)
    {
        LL_AHB1_GRP1_DisableClock(s_peripheral_state.ahb1_clock_mask);
    }
    if (s_peripheral_state.apb1_group1_clock_mask != 0U)
    {
        LL_APB1_GRP1_DisableClock(s_peripheral_state.apb1_group1_clock_mask);
    }
    if (s_peripheral_state.apb1_group2_clock_mask != 0U)
    {
        LL_APB1_GRP2_DisableClock(s_peripheral_state.apb1_group2_clock_mask);
    }
}

/* 按休眠前状态恢复由配置开关选中的普通外设。 */
static void lowpower_resume_peripherals(void)
{
    if (s_peripheral_state.ahb1_clock_mask != 0U)
    {
        LL_AHB1_GRP1_EnableClock(s_peripheral_state.ahb1_clock_mask);
    }
    if (s_peripheral_state.apb1_group1_clock_mask != 0U)
    {
        LL_APB1_GRP1_EnableClock(s_peripheral_state.apb1_group1_clock_mask);
    }
    if (s_peripheral_state.apb1_group2_clock_mask != 0U)
    {
        LL_APB1_GRP2_EnableClock(s_peripheral_state.apb1_group2_clock_mask);
    }

#if LOWPOWER_MANAGE_DMA1 && defined(DMA1)
    if ((s_peripheral_state.ahb1_clock_mask & LL_AHB1_GRP1_PERIPH_DMA1) != 0U)
    {
        DMA1_Channel1->CCR = s_peripheral_state.dma1_channel1_ccr;
        DMA1_Channel2->CCR = s_peripheral_state.dma1_channel2_ccr;
        DMA1_Channel3->CCR = s_peripheral_state.dma1_channel3_ccr;
    }
    lowpower_resume_irq(&s_peripheral_state.dma1_channel1_irq);
    lowpower_resume_irq(&s_peripheral_state.dma1_channel2_3_irq);
#endif

#if LOWPOWER_MANAGE_I2C1 && defined(I2C1)
    if ((s_peripheral_state.apb1_group1_clock_mask & LL_APB1_GRP1_PERIPH_I2C1) != 0U)
    {
        I2C1->CR2 = s_peripheral_state.i2c1_cr2;
        I2C1->CR1 = s_peripheral_state.i2c1_cr1;
    }
    lowpower_resume_irq(&s_peripheral_state.i2c1_irq);
#endif

#if LOWPOWER_MANAGE_USART2 && defined(USART2)
    if ((s_peripheral_state.apb1_group1_clock_mask & LL_APB1_GRP1_PERIPH_USART2) != 0U)
    {
        USART2->CR3 = s_peripheral_state.usart2_cr3;
        USART2->CR1 = s_peripheral_state.usart2_cr1;
    }
    lowpower_resume_irq(&s_peripheral_state.usart2_irq);
#endif

#if LOWPOWER_MANAGE_ADC1 && defined(ADC1)
    lowpower_restore_adc();
#endif

#if LOWPOWER_MANAGE_SPI1 && defined(SPI1)
    if ((s_peripheral_state.apb1_group2_clock_mask & LL_APB1_GRP2_PERIPH_SPI1) != 0U)
    {
        SPI1->CR2 = s_peripheral_state.spi1_cr2;
        SPI1->CR1 = s_peripheral_state.spi1_cr1;
    }
    lowpower_resume_irq(&s_peripheral_state.spi1_irq);
#endif

#if LOWPOWER_MANAGE_USART1 && defined(USART1)
    if ((s_peripheral_state.apb1_group2_clock_mask & LL_APB1_GRP2_PERIPH_USART1) != 0U)
    {
        USART1->CR3 = s_peripheral_state.usart1_cr3;
        USART1->CR1 = s_peripheral_state.usart1_cr1;
    }
    lowpower_resume_irq(&s_peripheral_state.usart1_irq);
#endif
}

/* 保存并暂停由配置开关选中的全部普通定时器。 */
static void lowpower_suspend_timers(void)
{
#if LOWPOWER_MANAGE_TIM1 && defined(TIM1)
    lowpower_suspend_timer(TIM1, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                           LL_APB1_GRP2_PERIPH_TIM1,
                           TIM1_BRK_UP_TRG_COM_IRQn, TIM1_CC_IRQn, 1U, &s_tim1_state);
#endif
#if LOWPOWER_MANAGE_TIM3 && defined(TIM3)
    lowpower_suspend_timer(TIM3, LOWPOWER_TIMER_BUS_APB1_GROUP1,
                           LL_APB1_GRP1_PERIPH_TIM3,
                           TIM3_IRQn, LOWPOWER_IRQ_UNUSED, 0U, &s_tim3_state);
#endif
#if LOWPOWER_MANAGE_TIM14 && defined(TIM14)
    lowpower_suspend_timer(TIM14, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                           LL_APB1_GRP2_PERIPH_TIM14,
                           TIM14_IRQn, LOWPOWER_IRQ_UNUSED, 0U, &s_tim14_state);
#endif
#if LOWPOWER_MANAGE_TIM16 && defined(TIM16)
    lowpower_suspend_timer(TIM16, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                           LL_APB1_GRP2_PERIPH_TIM16,
                           TIM16_IRQn, LOWPOWER_IRQ_UNUSED, 1U, &s_tim16_state);
#endif
#if LOWPOWER_MANAGE_TIM17 && defined(TIM17)
    lowpower_suspend_timer(TIM17, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                           LL_APB1_GRP2_PERIPH_TIM17,
                           TIM17_IRQn, LOWPOWER_IRQ_UNUSED, 1U, &s_tim17_state);
#endif
}

