SENKU114514/PY32F030BasicFrame/EXTERN/HW_INIT/LOWPOWER/LowPower.c
/* 按休眠前状态恢复由配置开关选中的全部普通定时器。 */
static void lowpower_resume_timers(void)
{
#if LOWPOWER_MANAGE_TIM1 && defined(TIM1)
    lowpower_resume_timer(TIM1, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                          LL_APB1_GRP2_PERIPH_TIM1,
                          TIM1_CC_IRQn, 1U, &s_tim1_state);
#endif
#if LOWPOWER_MANAGE_TIM3 && defined(TIM3)
    lowpower_resume_timer(TIM3, LOWPOWER_TIMER_BUS_APB1_GROUP1,
                          LL_APB1_GRP1_PERIPH_TIM3,
                          LOWPOWER_IRQ_UNUSED, 0U, &s_tim3_state);
#endif
#if LOWPOWER_MANAGE_TIM14 && defined(TIM14)
    lowpower_resume_timer(TIM14, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                          LL_APB1_GRP2_PERIPH_TIM14,
                          LOWPOWER_IRQ_UNUSED, 0U, &s_tim14_state);
#endif
#if LOWPOWER_MANAGE_TIM16 && defined(TIM16)
    lowpower_resume_timer(TIM16, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                          LL_APB1_GRP2_PERIPH_TIM16,
                          LOWPOWER_IRQ_UNUSED, 1U, &s_tim16_state);
#endif
#if LOWPOWER_MANAGE_TIM17 && defined(TIM17)
    lowpower_resume_timer(TIM17, LOWPOWER_TIMER_BUS_APB1_GROUP2,
                          LL_APB1_GRP2_PERIPH_TIM17,
                          LOWPOWER_IRQ_UNUSED, 1U, &s_tim17_state);
#endif
}

/* 根据头文件配置选择Stop0或Stop1的稳压器和保持电压。 */
static void lowpower_configure_stop_mode(void)
{
#if defined(PY32F002BPRE)
    /* RM 6.6.1: PWR_CR1, no F030 VOS/Stop1 voltage encoding. */
    LL_PWR_SetLprMode(LOWPOWER_002B_REGULATOR);
    LL_PWR_SetStopModeSramVoltCtrl(LL_PWR_SRAM_RETENTION_VOLT_CTRL_LDO);
    LL_PWR_SetWakeUpHSIOnMode(LL_PWR_WAKEUP_HSION_AFTER_MR);
    LL_PWR_SetWakeUpFlashDelay(LL_PWR_WAKEUP_FLASH_DELAY_5US);
#elif defined(PY32F030PRE)
#if (LOWPOWER_STOP_MODE == LOWPOWER_STOP_MODE_STOP0)
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
    LL_PWR_DisableLowPowerRunMode();
#elif (LOWPOWER_STOP_MODE == LOWPOWER_STOP_MODE_STOP1_1V2)
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
    LL_PWR_EnableLowPowerRunMode();
#else
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE2);
    LL_PWR_EnableLowPowerRunMode();
#endif
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
}

/* 保存应用指定的唤醒按键，不在模块中固定具体引脚。 */
static GPIO_index_e s_wakeup_pin;
static GPIO_mode_e s_wakeup_level;
static uint32_t s_wakeup_line;
static IRQn_Type s_wakeup_irq;
static uint8_t s_wakeup_initialized;

/* 初始化双边沿唤醒，下降或上升由实际有效电平决定。 */
HW_LowPower_Status_e HW_LowPower_init(GPIO_index_e pin, GPIO_pull_e pull,
                                     GPIO_mode_e active_level)
{
    uint32_t line_index;

    /* 第一步：检查参数和调用环境，保持原有配置直到新配置成功。 */
    if (__get_IPSR() != 0U)
        return HW_LOWPOWER_STATUS_HANDLER_MODE;
    if (__get_PRIMASK() != 0U)
        return HW_LOWPOWER_STATUS_INTERRUPTS_DISABLED;
    if (((pull != NO) && (pull != UP) && (pull != DOWN)) ||
        ((active_level != LOW) && (active_level != HIGH)))
        return HW_LOWPOWER_STATUS_INVALID_ARG;
    if (HW_GPIO_INPUT_IT_init(pin, pull, GPIO_IT_RISING_FALLING) != HW_GPIO_STATUS_OK)
        return HW_LOWPOWER_STATUS_WAKEUP_CONFIG_FAILED;

    /* 第二步：GPIO_index 每个端口连续定义 16 个引脚，取端口内编号。 */
    line_index = (uint32_t)pin % 16U;
    s_wakeup_line = 1UL << line_index;
    s_wakeup_irq = (line_index < 2U) ? EXTI0_1_IRQn :
                   ((line_index < 4U) ? EXTI2_3_IRQn : EXTI4_15_IRQn);
    s_wakeup_pin = pin;
    s_wakeup_level = active_level;
    s_wakeup_initialized = 1U;
    return HW_LOWPOWER_STATUS_OK;
}

/* 读取按下状态，把 GPIO 读失败交给外层恢复处理。 */
static uint8_t lowpower_read_pressed(uint8_t *pressed)
{
    uint8_t level;
    if (HW_GPIO_Get_SingleKey(s_wakeup_pin, &level) != HW_GPIO_STATUS_OK)
        return 0U;
    *pressed = (level == (uint8_t)s_wakeup_level) ? 1U : 0U;
    return 1U;
}

/* 先切离 PLL 再降频，使用 HSI 4MHz / AHB 4 分频得到 1MHz。 */
static void lowpower_use_check_clock(void)
{
#if defined(PY32F002BPRE)
    LL_PWR_SetLprMode(LL_PWR_LPR_MODE_MR);
#elif defined(PY32F030PRE)
    LL_PWR_DisableLowPowerRunMode();
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
    LL_RCC_HSI_Enable();
    while (LL_RCC_HSI_IsReady() == 0U) {}
    LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);
    LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSISYS);
    while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSISYS) {}
#if defined(PY32F030PRE)
    LL_RCC_PLL_Disable();
    while (LL_RCC_PLL_IsReady() != 0U) {}
#endif
    APP_SystemClockConfig(4U);
    LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_4);
    LL_SetSystemCoreClock(1000000U);
    SysTick->CTRL = 0U;
}

/* 等待长按确认，短按和松手不会恢复普通外设。 */
static HW_LowPower_Status_e lowpower_wait_long_press(uint8_t initially_pressed)
{
    LowPower_KeyState_t key;
    uint8_t pressed;
    lowpower_key_reset(&key, initially_pressed);
    lowpower_use_check_clock();

    for (;;)
    {
        /* 第一步：先清旧边沿再读电平，避免清除检查后刚到来的唤醒事件。 */
        LL_EXTI_ClearFlag(s_wakeup_line);
        NVIC_ClearPendingIRQ(s_wakeup_irq);
        if (lowpower_read_pressed(&pressed) == 0U)
            return HW_LOWPOWER_STATUS_KEY_READ_FAILED;
        if (pressed == 0U)
            (void)lowpower_key_sample(&key, 0U);

        /* 第二步：按下后启用 10ms 轮询时基，业务中断和普通外设仍暂停。 */
        if ((pressed != 0U) && (key.wait_release == 0U))
        {
            SysTick->LOAD = 1000000U / (1000U / LOWPOWER_KEY_SAMPLE_MS) - 1U;
            SysTick->VAL = 0U;
            SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;
            do
            {
                while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0U) {}
                if (lowpower_read_pressed(&pressed) == 0U)
                {
                    SysTick->CTRL = 0U;
                    return HW_LOWPOWER_STATUS_KEY_READ_FAILED;
                }
                if (lowpower_key_sample(&key, pressed) != 0U)
                {
                    SysTick->CTRL = 0U;
                    return HW_LOWPOWER_STATUS_OK;
                }
            } while (pressed != 0U);
            SysTick->CTRL = 0U;
            continue;
        }

        /* 第三步：未按下或等待松手时进入 Stop1，不用周期中断反复唤醒。 */
        lowpower_configure_stop_mode();
        LL_LPM_DisableSleepOnExit();
        LL_LPM_EnableDeepSleep();
        __DSB();
        __WFI();
        __ISB();
        LL_LPM_EnableSleep();
        lowpower_use_check_clock();
    }
}

