SENKU114514/PY32F030BasicFrame/EXTERN/HW_INIT/LOWPOWER/LowPower.c
/* 默认不处理板级负载，用户可在APP层用同名函数覆盖。 */
__weak uint8_t HW_LowPower_PrepareCallback(void)
{
    return 1U;
}

/* 默认不恢复板级负载，用户可在APP层用同名函数覆盖。 */
__weak void HW_LowPower_RestoreCallback(void)
{
}

/* 暂停普通外设，等待长按确认，再恢复休眠前的运行状态。 */
HW_LowPower_Status_e HW_LowPower_Enter(void)
{
#if defined(PY32F002BPRE)
    uint32_t saved_pwr_cr1;
#endif
    uint32_t was_pwr_clock_enabled;
    uint32_t saved_irq_mask;
    uint32_t saved_exti_mask;
    uint32_t saved_systick_ctrl;
    uint32_t saved_systick_load;
    uint32_t saved_scr;
    uint32_t saved_system_pending;
    uint32_t saved_flash_latency;
    uint32_t saved_core_clock = SystemCoreClock;
    uint32_t saved_source = LL_RCC_GetSysClkSource();
    uint8_t pressed;
    HW_LowPower_Status_e status;

    /* 第一步：只接收主循环调用，支持本框架 HSI/PLL 的常用频率。 */
    if (__get_IPSR() != 0U)
        return HW_LOWPOWER_STATUS_HANDLER_MODE;
    if (__get_PRIMASK() != 0U)
        return HW_LOWPOWER_STATUS_INTERRUPTS_DISABLED;
    if (s_wakeup_initialized == 0U)
        return HW_LOWPOWER_STATUS_NOT_INITIALIZED;
#if defined(PY32F002BPRE)
    if (((saved_core_clock != 4000000U) && (saved_core_clock != 8000000U) &&
         (saved_core_clock != 24000000U)) ||
        LL_RCC_GetAHBPrescaler() != LL_RCC_SYSCLK_DIV_1 ||
        LL_RCC_GetAPB1Prescaler() != LL_RCC_APB1_DIV_1 ||
        LL_RCC_GetHSIDiv() != LL_RCC_HSI_DIV_1 ||
        saved_source != LL_RCC_SYS_CLKSOURCE_STATUS_HSISYS)
        return HW_LOWPOWER_STATUS_UNSUPPORTED_CLOCK;
#elif defined(PY32F030PRE)
    if (((saved_core_clock != 4000000U) && (saved_core_clock != 8000000U) &&
         (saved_core_clock != 16000000U) && (saved_core_clock != 24000000U) &&
         (saved_core_clock != 48000000U)) ||
        (LL_RCC_GetAHBPrescaler() != LL_RCC_SYSCLK_DIV_1) ||
        (LL_RCC_GetAPB1Prescaler() != LL_RCC_APB1_DIV_1) ||
        (LL_RCC_GetHSIDiv() != LL_RCC_HSI_DIV_1) ||
        ((saved_core_clock == 48000000U) !=
         (saved_source == LL_RCC_SYS_CLKSOURCE_STATUS_PLL)) ||
        ((saved_source != LL_RCC_SYS_CLKSOURCE_STATUS_HSISYS) &&
         (saved_source != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)) ||
        ((saved_source == LL_RCC_SYS_CLKSOURCE_STATUS_PLL) &&
         (LL_RCC_PLL_GetMainSource() != LL_RCC_PLLSOURCE_HSI)))
        return HW_LOWPOWER_STATUS_UNSUPPORTED_CLOCK;
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
    if (lowpower_read_pressed(&pressed) == 0U)
        return HW_LOWPOWER_STATUS_KEY_READ_FAILED;

    /* 第二步：完成板级准备并检查外设空闲，不强停正在进行的通信。 */
    if (HW_LowPower_PrepareCallback() == 0U)
        return HW_LOWPOWER_STATUS_PERIPHERAL_BUSY;
    if (lowpower_prepare_adc() == 0U)
    {
        HW_LowPower_RestoreCallback();
        return HW_LOWPOWER_STATUS_SUSPEND_FAILED;
    }
    __disable_irq();
    if (lowpower_peripheral_is_busy() != 0U)
    {
        lowpower_restore_adc();
        HW_LowPower_RestoreCallback();
        __enable_irq();
        return HW_LOWPOWER_STATUS_PERIPHERAL_BUSY;
    }

    /* 第三步：保存系统状态，暂停普通外设，只保留指定按键的唤醒通路。 */
    saved_irq_mask = NVIC->ISER[0];
    saved_exti_mask = EXTI->IMR;
    saved_systick_ctrl = SysTick->CTRL;
    saved_systick_load = SysTick->LOAD;
    saved_scr = SCB->SCR;
    saved_system_pending = SCB->ICSR & (SCB_ICSR_PENDSTSET_Msk | SCB_ICSR_PENDSVSET_Msk);
    saved_flash_latency = LL_FLASH_GetLatency();
    SysTick->CTRL = 0U;
    SCB->ICSR = SCB_ICSR_PENDSTCLR_Msk | SCB_ICSR_PENDSVCLR_Msk;
    lowpower_suspend_peripherals();
    lowpower_suspend_timers();
    NVIC->ICER[0] = 0xFFFFFFFFUL;
    EXTI->IMR = s_wakeup_line;
    NVIC_EnableIRQ(s_wakeup_irq);
    was_pwr_clock_enabled = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_PWR);
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);
#if defined(PY32F002BPRE)
    saved_pwr_cr1 = PWR->CR1;
#endif

    /* 第四步：进入低功耗等待，连续长按 3 秒才返回成功。 */
    status = lowpower_wait_long_press(pressed);

    /* 第五步：先恢复主频和时基，再恢复外设，避免分频变化影响运行。 */
    LL_LPM_EnableSleep();
#if defined(PY32F002BPRE)
    LL_PWR_SetLprMode(LL_PWR_LPR_MODE_MR);
#elif defined(PY32F030PRE)
    LL_PWR_DisableLowPowerRunMode();
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
#else
#error "Unsupported MCU: select PY32F002B or PY32F030"
#endif
    APP_SystemClockConfig((uint8_t)(saved_core_clock / 1000000U));
    LL_FLASH_SetLatency(saved_flash_latency);
    SysTick->CTRL = 0U;
    SysTick->LOAD = saved_systick_load;
    SysTick->VAL = 0U;
    lowpower_resume_peripherals();
    lowpower_resume_timers();
    HW_LowPower_RestoreCallback();

    /* 第六步：消费本次唤醒边沿，恢复原中断配置后把控制权交还主循环。 */
    LL_EXTI_ClearFlag(s_wakeup_line);
    NVIC_ClearPendingIRQ(s_wakeup_irq);
    EXTI->IMR = saved_exti_mask;
    NVIC->ICER[0] = 0xFFFFFFFFUL;
    NVIC->ISER[0] = saved_irq_mask;
    SCB->SCR = saved_scr;
    SCB->ICSR = saved_system_pending;
    SysTick->CTRL = saved_systick_ctrl;
#if defined(PY32F002BPRE)
    PWR->CR1 = saved_pwr_cr1;
#endif
    if (was_pwr_clock_enabled == 0U)
        LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_PWR);
    __enable_irq();
    __ISB();
    return status;
}
